---
kind: other
id: Methods.T:Autodesk.Revit.DB.MultiReferenceAnnotationOptions
source: html/c6c7d3d5-a73f-841e-2e2b-00013dec3044.htm
---
# MultiReferenceAnnotationOptions Methods

Verifies that all of the elements match the reference category required
 by the MultiReferenceAnnotationType.